span999/span-winceframework/PIC-MPLab/PIC18_proj/pic18fxxj60_dk.X/interrupts.c
/******************************************************************************/
/*Files to Include                                                            */
/******************************************************************************/

#if defined(__XC)
    #include <xc.h>         /* XC8 General Include File */
#elif defined(HI_TECH_C)
    #include <htc.h>        /* HiTech General Include File */
#elif defined(__18CXX)
    #include <p18cxxx.h>    /* C18 General Include File */
#endif

#if defined(__XC) || defined(HI_TECH_C)

#include <stdint.h>         /* For uint8_t definition */
#include <stdbool.h>

#include "sp_userdef.h"        /* For true/false definition */

#endif


extern struct spSysCnt          g_SystemCounter;



/******************************************************************************/
/* Interrupt Routines                                                         */
/******************************************************************************/

/* High-priority service */

#if defined(__XC) || defined(HI_TECH_C)
void interrupt high_isr(void)
#elif defined (__18CXX)
#pragma code high_isr=0x08
#pragma interrupt high_isr
void high_isr(void)
#else
#error "Invalid compiler selection for implemented ISR routines"
#endif

{

      /* This code stub shows general interrupt handling.  Note that these
      conditional statements are not handled within 3 seperate if blocks.
      Do not use a seperate if block for each interrupt flag to avoid run
      time errors. */

#if 0
    
      /* TODO Add High Priority interrupt routine code here. */

      /* Determine which flag generated the interrupt */
      if(<Interrupt Flag 1>)
      {
          <Interrupt Flag 1=0>; /* Clear Interrupt Flag 1 */
      }
      else if (<Interrupt Flag 2>)
      {
          <Interrupt Flag 2=0>; /* Clear Interrupt Flag 2 */
      }
      else
      {
          /* Unhandled interrupts */
      }

#endif

    if( 1 == INTCONbits.TMR0IF ) {
        ///INTCONbits.TMR0IE = 0;              /* disable Timer0 interrupt */
        INTCONbits.TMR0IF = 0;              /* clear pending flag */
#ifdef __TMR0_USE_8BIT__   /* 8-bit */
        TMR0 = 0xE6;                    /* 25 tick = 160ns x 25 = 40us */

        g_SystemCounter.Tmr0Cnt++;
        if( g_SystemCounter.Tmr0Cnt >= 25 ) {
            g_SystemCounter.MsCnt++;        /* 1ms */
            g_SystemCounter.Tmr0Cnt = 0;
        }
        if( g_SystemCounter.MsCnt >= 1000 ) {
            g_SystemCounter.SecCnt++;       /* 1sec */
            g_SystemCounter.MsCnt = 0;
        }
#else   /* 16-bit */
        TMR0L = 0x95;                       /* 6250 tick = 160ns x 6250 = 1ms */
        TMR0H = 0xE7;
        g_SystemCounter.Tmr0Cnt++;
        g_SystemCounter.MsCnt++;        /* 1ms */

        if( g_SystemCounter.MsCnt >= 1000 ) {
            g_SystemCounter.SecCnt++;       /* 1sec */
            g_SystemCounter.MsCnt = 0;
        }
#endif
        ///INTCONbits.TMR0IE = 1;              /* enable Timer0 interrupt */
    }

}

/* Low-priority interrupt routine */
#if defined(__XC) || defined(HI_TECH_C)
void low_priority interrupt low_isr(void)
#elif defined (__18CXX)
#pragma code low_isr=0x18
#pragma interruptlow low_isr
void low_isr(void)
#else
#error "Invalid compiler selection for implemented ISR routines"
#endif
{

      /* This code stub shows general interrupt handling.  Note that these
      conditional statements are not handled within 3 seperate if blocks.
      Do not use a seperate if block for each interrupt flag to avoid run
      time errors. */

#if 0

      /* TODO Add Low Priority interrupt routine code here. */

      /* Determine which flag generated the interrupt */
      if(<Interrupt Flag 1>)
      {
          <Interrupt Flag 1=0>; /* Clear Interrupt Flag 1 */
      }
      else if (<Interrupt Flag 2>)
      {
          <Interrupt Flag 2=0>; /* Clear Interrupt Flag 2 */
      }
      else
      {
          /* Unhandled interrupts */
      }

#endif


}
